package lesson32.task5;

public class Main {

    // Есть три потока.
    // 1 поток выводит в консоль пять раз букву А (без переноса строки)
    // 2 поток выводит в консоль пять раз букву В (без переноса строки)
    // 3 поток выводит в консоль пять раз букву С (без переноса строки)
    // Запустить потоки одновременно, но синхронизировать их таким образом,
    // чтобы получить вывод в консоль -> ABCABCABCABCABC
    // Результат должен выводиться моментально,
    // то есть sleep использовать нельзя.
    // Можно использовать любые знания, полученные на модуле.
}